from dataclasses import dataclass


@dataclass
class ButtonNames:
    type_sport = [
        "ОФП",
        "Волейбол",
        "Баскетбол",
        "Футбол",
        "Уличные тренажеры",
        "Настольный теннис",
        "Шахматы",
        "Хоккей",
        "ГТО",
        "Воркаут",
        "Стритбол",
        "Комплекс",
        "Скейтбординг",
    ]
    district = [
        "Калининский",
        "Выборгский",
        "Василеостровский",
        "Адмиралтейский",
        "Кировский",
        "Колпинский",
        "Красногвардейский",
        "Красносельский",
        "Кронштадтский",
        "Курортный",
        "Московский",
        "Невский",
        "Петроградский",
        "Петродворцовый",
        "Приморский",
        "Пушкинский",
        "Фрунзенский",
        "Центральный",
    ]
    status = [
        "работающий",
        "временно приостановлено посещение",
        "не работающая",
    ]